{
  "favoritMovies": [
    {
      "id": "1125899",
      "adult": false,
      "genre_ids": [
        28,
        53
      ],
      "overview": "When a group of radical activists take over an energy company's annual gala, seizing 300 hostages, an ex-soldier turned window cleaner suspended 50 storeys up on the outside of the building must save those trapped inside, including her younger brother.",
      "popularity": 441.6987,
      "poster_path": "/2KIqFpvjVI6mNBTQw7MYZdzRYvs.jpg",
      "release_date": "2025-02-19",
      "title": "Cleaner",
      "vote_average": 6.832,
      "vote_count": 131
    },
    {
      "id": "1165067",
      "adult": false,
      "genre_ids": [
        53,
        878
      ],
      "overview": "Battles in virtual reality, survival in a post-apocalyptic wasteland, a Soviet spaceship giving a distress signal - Fantastic stories created with advanced special effects and passion.",
      "popularity": 351.734,
      "poster_path": "/mClzWv7gBqgXfjZXp49Enyoex1v.jpg",
      "release_date": "2023-08-03",
      "title": "Cosmic Chaos",
      "vote_average": 6.9,
      "vote_count": 25
    },
    {
      "id": "1229730",
      "adult": false,
      "genre_ids": [
        28,
        12
      ],
      "overview": "By day, they're invisible—valets, hostesses, and bartenders at a luxury hotel. By night, they're the Carjackers, a crew of skilled drivers who track and rob wealthy clients on the road. As they plan their ultimate heist, the hotel director hires a ruthless hitman, to stop them at all costs. With danger closing in, can Nora, Zoe, Steve, and Prestance pull off their biggest score yet?",
      "popularity": 414.4371,
      "poster_path": "/6QZ3B6R3PTL54AESD11HfqeFzON.jpg",
      "release_date": "2025-03-27",
      "title": "Carjackers",
      "vote_average": 7,
      "vote_count": 30
    },
    {
      "id": "447273",
      "adult": false,
      "genre_ids": [
        10751,
        14
      ],
      "overview": "Princess Snow White flees the castle when the Evil Queen, in her jealousy over Snow White's inner beauty, tries to kill her. Deep into the dark woods, she stumbles upon seven magical dwarves and a young thief named Jonathan. Together, they strive to survive the Queen's relentless pursuit and aspire to take back the kingdom in the process.",
      "popularity": 207.6622,
      "poster_path": "/xWWg47tTfparvjK0WJNX4xL8lW2.jpg",
      "release_date": "2025-03-19",
      "title": "Snow White",
      "vote_average": 4.4,
      "vote_count": 452
    }
  ]
}